Revit 2026 API

# EffectInstanceMatchesFormat Method

---

Tests whether the effect instance is appropriate for the given vertex format.

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool MatchesFormat(
	VertexFormat vertexFormat
)
```
```vb
Public Function MatchesFormat (
	vertexFormat As VertexFormat
) As Boolean
```
```cpp
public:
bool MatchesFormat(
	VertexFormat^ vertexFormat
)
```
```fsharp
member MatchesFormat :
        vertexFormat : VertexFormat -> bool
```

#### Parameters

vertexFormat VertexFormat
     A vertex format.

#### Return Value

Boolean True if the effect instance is valid for use with the specified vertex format.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The vertex format may define vertex data that are not used by the effect instance. However, the effect instance can not reference vertex data that do not exist in the vertex format.

#### Reference

EffectInstance Class

Autodesk.Revit.DB.DirectContext3D Namespace